{
    "1241436": {
        "title": "Warfare",
        "release_date": "2025-04-09",
        "vote_average": 7.209,
        "overview": "A platoon of Navy SEALs embarks on a dangerous mission in Ramadi, Iraq, with the chaos and brotherhood of war retold through their memories of the event."
    },
    "1233069": {
        "title": "Exterritorial",
        "release_date": "2025-04-29",
        "vote_average": 6.631,
        "overview": "When her son vanishes inside a US consulate, ex-special forces soldier Sara does everything in her power to find him — and uncovers a dark conspiracy."
    },
    "986056": {
        "title": "Thunderbolts*",
        "release_date": "2025-04-30",
        "vote_average": 7.5,
        "overview": "After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts."
    },
    "1144430": {
        "title": "Last Bullet",
        "release_date": "2025-05-06",
        "vote_average": 6.946,
        "overview": "Car genius Lino returns to conclude his vendetta against Areski and the corrupt commander who ruined their lives in this turbo-charged trilogy finale."
    },
    "1197306": {
        "title": "A Working Man",
        "release_date": "2025-03-26",
        "vote_average": 6.51,
        "overview": "Levon Cade left behind a decorated military career in the black ops to live a simple life working construction. But when his boss's daughter, who is like family to him, is taken by human traffickers, his search to bring her home uncovers a world of corruption far greater than he ever could have imagined."
    },
    "710258": {
        "title": "Rust",
        "release_date": "2025-05-01",
        "vote_average": 6.3,
        "overview": "Infamous outlaw Harland Rust breaks his estranged grandson Lucas out of prison, after Lucas is convicted to hang for an accidental murder. The two must outrun legendary U.S Marshal Wood Helm and bounty hunter Fenton \"Preacher\" Lang who are hot on their tails. Deeply buried secrets rise from the ashes and an unexpected familial bond begins to form as the mismatched duo tries to survive the merciless American Frontier."
    },
    "950387": {
        "title": "A Minecraft Movie",
        "release_date": "2025-03-31",
        "vote_average": 6.154,
        "overview": "Four misfits find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world while embarking on a magical quest with an unexpected, expert crafter, Steve."
    },
    "822119": {
        "title": "Captain America: Brave New World",
        "release_date": "2025-02-12",
        "vote_average": 6.138,
        "overview": "After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an international incident. He must discover the reason behind a nefarious global plot before the true mastermind has the entire world seeing red."
    },
    "37135": {
        "title": "Tarzan",
        "release_date": "1999-06-18",
        "vote_average": 7.396,
        "overview": "Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to..."
    },
    "897160": {
        "title": "Brave Citizen",
        "release_date": "2023-10-25",
        "vote_average": 7.1,
        "overview": "An expelled boxing champion, who now is a high-school teacher, witnesses intolerable violence and throws her first punch to build justice against it, while putting on a mask."
    },
    "668489": {
        "title": "Havoc",
        "release_date": "2025-04-24",
        "vote_average": 6.5,
        "overview": "When a drug heist swerves lethally out of control, a jaded cop fights his way through a corrupt city's criminal underworld to save a politician's son."
    },
    "1225915": {
        "title": "Jewel Thief: The Heist Begins",
        "release_date": "2025-04-25",
        "vote_average": 6.557,
        "overview": "In this high-octane battle of wits and wills, ingenious con artist Rehan devises a diamond heist while trying to outsmart Rajan, his sadistic adversary."
    },
    "1153714": {
        "title": "Death of a Unicorn",
        "release_date": "2025-03-27",
        "vote_average": 6.459,
        "overview": "A father and daughter accidentally hit and kill a unicorn while en route to a weekend retreat, where his billionaire boss seeks to exploit the creature’s miraculous curative properties."
    },
    "302946": {
        "title": "The Accountant",
        "release_date": "2016-10-03",
        "vote_average": 7.102,
        "overview": "As a math savant uncooks the books for a new client, the Treasury Department closes in on his activities and the body count starts to rise."
    },
    "1323784": {
        "title": "Bad Influence",
        "release_date": "2025-01-24",
        "vote_average": 6.275,
        "overview": "An ex-con gets a fresh start when hired to protect a wealthy heiress from a stalker — but their chemistry is hard to resist as they grow closer."
    },
    "324544": {
        "title": "In the Lost Lands",
        "release_date": "2025-02-27",
        "vote_average": 6.325,
        "overview": "A queen sends the powerful and feared sorceress Gray Alys to the ghostly wilderness of the Lost Lands in search of a magical power, where she and her guide, the drifter Boyce, must outwit and outfight both man and demon."
    },
    "1359977": {
        "title": "Conjuring the Cult",
        "release_date": "2024-10-01",
        "vote_average": 3.75,
        "overview": "After discovering his blood-soaked daughter dead in the bathtub, David Bryson attends a self-help group to help save him from his ghostly nightmares. But when a group of mysterious cult-like women offer to help him resurrect his daughter. David's choices will not just decide his fate... but the fate of his dead daughter's SOUL."
    },
    "1233413": {
        "title": "Sinners",
        "release_date": "2025-04-16",
        "vote_average": 7.594,
        "overview": "Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, only to discover that an even greater evil is waiting to welcome them back."
    },
    "1471014": {
        "title": "Van Gogh by Vincent",
        "release_date": "2025-03-26",
        "vote_average": 6.4,
        "overview": "In a career that lasted only ten years, Vincent Van Gogh painted one subject more than any other: himself. This is the story of Vincent told using eight of his most iconic self-portraits."
    },
    "1356236": {
        "title": "Saint Catherine",
        "release_date": "2024-09-24",
        "vote_average": 6.34,
        "overview": "An orphaned girl is rescued from a satanic ritual and taken to Saint Catherine Institute for homeless youth. There she will learn new skills while facing demons that stalk her."
    },
    "1260820": {
        "title": "Stream",
        "release_date": "2024-02-06",
        "vote_average": 6.25,
        "overview": "Craven, a streamer with thousands of followers on a live streaming platform, has prepared a very special stream for Halloween. What no one expects when reacting to a video of Pentagram, a group of young paranormal investigators, is that the live experience will turn into the worst night of their lives. And maybe... the last."
    },
    "1403735": {
        "title": "Laila",
        "release_date": "2025-02-14",
        "vote_average": 5.0,
        "overview": "Sonu Model, a renowned beautician from the old city, is forced to disguise himself as Laila, leading to a series of comedic, romantic, and action-packed events. Chaos ensues in this hilarious laugh riot"
    },
    "497698": {
        "title": "Black Widow",
        "release_date": "2021-07-07",
        "vote_average": 7.208,
        "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger."
    },
    "974573": {
        "title": "Another Simple Favor",
        "release_date": "2025-03-07",
        "vote_average": 6.1,
        "overview": "Stephanie and Emily reunite on the beautiful island of Capri, Italy for Emily's extravagant wedding to a rich Italian businessman. Along with the glamorous guests, expect murder and betrayal to RSVP for a wedding with more twists and turns than the road from the Marina Grande to the Capri town square."
    },
    "1124620": {
        "title": "The Monkey",
        "release_date": "2025-02-14",
        "vote_average": 5.885,
        "overview": "When twin brothers find a mysterious wind-up monkey, a series of outrageous deaths tear their family apart. Twenty-five years later, the monkey begins a new killing spree forcing the estranged brothers to confront the cursed toy."
    },
    "974576": {
        "title": "Conclave",
        "release_date": "2024-10-25",
        "vote_average": 7.204,
        "overview": "After the unexpected death of the Pope, Cardinal Lawrence is tasked with managing the covert and ancient ritual of electing a new one. Sequestered in the Vatican with the Catholic Church’s most powerful leaders until the process is complete, Lawrence finds himself at the center of a conspiracy that could lead to its downfall."
    },
    "1241982": {
        "title": "Moana 2",
        "release_date": "2024-11-21",
        "vote_average": 7.077,
        "overview": "After receiving an unexpected call from her wayfinding ancestors, Moana journeys alongside Maui and a new crew to the far seas of Oceania and into dangerous, long-lost waters for an adventure unlike anything she's ever faced."
    },
    "1414048": {
        "title": "Day of Reckoning",
        "release_date": "2025-03-28",
        "vote_average": 6.7,
        "overview": "Put-upon lawman John Dorsey is on the verge of losing his wife and his job as sheriff, so he posses up with bullish U.S. Marshall Butch Hayden to hold outlaw Emily Rusk hostage. A battle of wills ensues as Emily turns the posse on themselves, but as her marauding husband and his gang approach, Emily and John realize they will need each other to survive."
    },
    "1180906": {
        "title": "Desert Dawn",
        "release_date": "2025-05-15",
        "vote_average": 9.0,
        "overview": "A newly appointed small-town sheriff and his begrudging deputy get tangled up in a web of lies and corruption involving shady businessmen and the cartel while investigating the murder of a mysterious woman."
    },
    "1136721": {
        "title": "The Glenarma Tapes",
        "release_date": "2024-04-02",
        "vote_average": 6.1,
        "overview": "In Spring 2020 when five students and two faculty members from the Mid Ulster College of Art go missing in a forest on the north coast of Ireland. What happened on the day they disappeared has remained a mystery - until now."
    },
    "1151039": {
        "title": "Nonnas",
        "release_date": "2025-05-01",
        "vote_average": 6.632,
        "overview": "After losing his beloved mother, a man risks everything to honor her by opening an Italian restaurant with actual nonnas — grandmothers — as the chefs."
    },
    "141052": {
        "title": "Justice League",
        "release_date": "2017-11-15",
        "vote_average": 6.075,
        "overview": "Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth."
    },
    "299537": {
        "title": "Captain Marvel",
        "release_date": "2019-03-06",
        "vote_average": 6.802,
        "overview": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe."
    },
    "1276073": {
        "title": "Bullet Train Explosion",
        "release_date": "2025-04-23",
        "vote_average": 6.877,
        "overview": "When panic erupts on a Tokyo-bound bullet train that will explode if it slows below 100 kph, authorities race against time to save everyone on board."
    },
    "464052": {
        "title": "Wonder Woman 1984",
        "release_date": "2020-12-16",
        "vote_average": 6.412,
        "overview": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy."
    },
    "574475": {
        "title": "Final Destination Bloodlines",
        "release_date": "2025-05-09",
        "vote_average": 6.9,
        "overview": "Plagued by a violent recurring nightmare, college student Stefanie heads home to track down the one person who might be able to break the cycle and save her family from the grisly demise that inevitably awaits them all."
    },
    "345940": {
        "title": "The Meg",
        "release_date": "2018-08-09",
        "vote_average": 6.248,
        "overview": "A deep sea submersible pilot revisits his past fears in the Mariana Trench, and accidentally unleashes the seventy foot ancestor of the Great White Shark believed to be extinct."
    },
    "263115": {
        "title": "Logan",
        "release_date": "2017-02-28",
        "vote_average": 7.82,
        "overview": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces."
    },
    "1092899": {
        "title": "The Siege",
        "release_date": "2023-03-10",
        "vote_average": 5.448,
        "overview": "International assassin Walker is compromised during a mission and sent to a reassignment center for a new identity. During his stay at the facility, a ruthless assault team storms the compound searching for someone their boss has lost. Walker begrudgingly falls in with skilled hitwoman Elda and her mysterious ward Juliet in order to survive the night."
    },
    "1249213": {
        "title": "Drop",
        "release_date": "2025-04-10",
        "vote_average": 6.539,
        "overview": "Violet, a widowed mother on her first date in years, arrives at an upscale restaurant where she is relieved that her date, Henry, is more charming and handsome than she expected. But their chemistry begins to curdle as Violet begins being irritated and then terrorized by a series of anonymous drops to her phone."
    },
    "281338": {
        "title": "War for the Planet of the Apes",
        "release_date": "2017-07-11",
        "vote_average": 7.206,
        "overview": "Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet."
    },
    "1195506": {
        "title": "Novocaine",
        "release_date": "2025-03-12",
        "vote_average": 6.908,
        "overview": "When the girl of his dreams is kidnapped, everyman Nate turns his inability to feel pain into an unexpected strength in his fight to get her back."
    },
    "297762": {
        "title": "Wonder Woman",
        "release_date": "2017-05-30",
        "vote_average": 7.217,
        "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict."
    },
    "762509": {
        "title": "Mufasa: The Lion King",
        "release_date": "2024-12-18",
        "vote_average": 7.409,
        "overview": "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny."
    },
    "939243": {
        "title": "Sonic the Hedgehog 3",
        "release_date": "2024-12-19",
        "vote_average": 7.727,
        "overview": "Sonic, Knuckles, and Tails reunite against a powerful new adversary, Shadow, a mysterious villain with powers unlike anything they have faced before. With their abilities outmatched in every way, Team Sonic must seek out an unlikely alliance in hopes of stopping Shadow and protecting the planet."
    },
    "1011477": {
        "title": "Karate Kid: Legends",
        "release_date": "2025-05-08",
        "vote_average": 7.35,
        "overview": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition – but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown."
    },
    "370172": {
        "title": "No Time to Die",
        "release_date": "2021-09-29",
        "vote_average": 7.4,
        "overview": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology."
    },
    "126889": {
        "title": "Alien: Covenant",
        "release_date": "2017-05-09",
        "vote_average": 6.156,
        "overview": "The crew of the colony ship Covenant, bound for a remote planet on the far side of the galaxy, discovers what they think is an uncharted paradise but is actually a dark, dangerous world."
    },
    "335984": {
        "title": "Blade Runner 2049",
        "release_date": "2017-10-04",
        "vote_average": 7.6,
        "overview": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years."
    },
    "870028": {
        "title": "The Accountant²",
        "release_date": "2025-04-23",
        "vote_average": 7.235,
        "overview": "When an old acquaintance is murdered, Wolff is compelled to solve the case. Realizing more extreme measures are necessary, Wolff recruits his estranged and highly lethal brother, Brax, to help. In partnership with Marybeth Medina, they uncover a deadly conspiracy, becoming targets of a ruthless network of killers who will stop at nothing to keep their secrets buried."
    },
    "324786": {
        "title": "Hacksaw Ridge",
        "release_date": "2016-10-07",
        "vote_average": 8.193,
        "overview": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first Conscientious Objector in American history to receive the Congressional Medal of Honor."
    },
    "418078": {
        "title": "It Comes at Night",
        "release_date": "2017-06-09",
        "vote_average": 5.8,
        "overview": "Secure within a desolate home as an unnatural threat terrorizes the world, a man has established a tenuous domestic order with his wife and son, but this will soon be put to test when a desperate young family arrives seeking refuge."
    },
    "1469239": {
        "title": "Karol G: Tomorrow Was Beautiful",
        "release_date": "2025-04-30",
        "vote_average": 8.093,
        "overview": "Karol G pulls back the curtain on her rise to stardom while navigating a sold-out stadium tour, creating new music and releasing a new album."
    },
    "1045938": {
        "title": "G20",
        "release_date": "2025-04-10",
        "vote_average": 6.6,
        "overview": "After the G20 Summit is overtaken by terrorists, President Danielle Sutton must bring all her statecraft and military experience to defend her family and her fellow leaders."
    },
    "575265": {
        "title": "Mission: Impossible - The Final Reckoning",
        "release_date": "2025-05-17",
        "vote_average": 0.0,
        "overview": "Ethan Hunt and the IMF team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Ethan's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever."
    },
    "1307520": {
        "title": "The Biggest Fan",
        "release_date": "2025-05-01",
        "vote_average": 5.265,
        "overview": "Canceled in Hollywood, star Lana Cruz heads to her hometown for a comeback. Enter Polly, her fan-turned-frenemy. Can Lana dodge drama and reclaim her fame?"
    },
    "238": {
        "title": "The Godfather",
        "release_date": "1972-03-14",
        "vote_average": 8.687,
        "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge."
    },
    "383498": {
        "title": "Deadpool 2",
        "release_date": "2018-05-15",
        "vote_average": 7.49,
        "overview": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life."
    },
    "1010581": {
        "title": "My Fault",
        "release_date": "2023-06-08",
        "vote_average": 7.814,
        "overview": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning."
    },
    "872585": {
        "title": "Oppenheimer",
        "release_date": "2023-07-19",
        "vote_average": 8.06,
        "overview": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II."
    },
    "950396": {
        "title": "The Gorge",
        "release_date": "2025-02-13",
        "vote_average": 7.718,
        "overview": "Two highly trained operatives grow close from a distance after being sent to guard opposite sides of a mysterious gorge. When an evil below emerges, they must work together to survive what lies within."
    },
    "353491": {
        "title": "The Dark Tower",
        "release_date": "2017-08-03",
        "vote_average": 5.771,
        "overview": "A boy haunted by visions of a parallel world aids its disillusioned guardian in preventing the destruction of the nexus of universes known as the Dark Tower."
    },
    "402": {
        "title": "Basic Instinct",
        "release_date": "1992-03-20",
        "vote_average": 6.934,
        "overview": "Catherine, a novelist with an insatiable sexual appetite, becomes a prime suspect when her boyfriend is brutally murdered -- a crime she had described in her latest story."
    },
    "1126166": {
        "title": "Flight Risk",
        "release_date": "2025-01-22",
        "vote_average": 6.1,
        "overview": "A U.S. Marshal escorts a government witness to trial after he's accused of getting involved with a mob boss, only to discover that the pilot who is transporting them is also a hitman sent to assassinate the informant. After they subdue him, they're forced to fly together after discovering that there are others attempting to eliminate them."
    },
    "1244944": {
        "title": "The Woman in the Yard",
        "release_date": "2025-03-27",
        "vote_average": 6.243,
        "overview": "In the aftermath of her husband's death, widow Ramona's struggle to raise her two kids is hindered by the arrival of a mysterious woman with supernatural abilities."
    },
    "453395": {
        "title": "Doctor Strange in the Multiverse of Madness",
        "release_date": "2022-05-04",
        "vote_average": 7.261,
        "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary."
    },
    "458156": {
        "title": "John Wick: Chapter 3 - Parabellum",
        "release_date": "2019-05-15",
        "vote_average": 7.443,
        "overview": "Super-assassin John Wick returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn."
    },
    "395834": {
        "title": "Wind River",
        "release_date": "2017-08-03",
        "vote_average": 7.437,
        "overview": "An FBI agent teams with the town's veteran game tracker to investigate a murder that occurred on a Native American reservation."
    },
    "1189423": {
        "title": "The Sloth Lane",
        "release_date": "2024-07-25",
        "vote_average": 6.5,
        "overview": "After a terrifying storm destroys their home, a speedy sloth named Laura and her kooky family move to the big city in their rusted old food truck, Gordito, hoping to make their business a success. The family's delicious food catches the eye of a quick-witted cheetah who will stop at nothing to revive her failing fast-food business."
    },
    "1252309": {
        "title": "Ask Me What You Want",
        "release_date": "2024-11-29",
        "vote_average": 5.997,
        "overview": "After his father's death, Eric Zimmerman travels to Spain to oversee his company's branches. In Madrid, he falls for Judith and engage in an intense, erotic relationship full of exploration. However, Eric fears his secret may end their affair."
    },
    "181812": {
        "title": "Star Wars: The Rise of Skywalker",
        "release_date": "2019-12-18",
        "vote_average": 6.3,
        "overview": "The surviving Resistance faces the First Order once again as the journey of Rey, Finn and Poe Dameron continues. With the power and knowledge of generations behind them, the final battle begins."
    },
    "811941": {
        "title": "Devara: Part 1",
        "release_date": "2024-09-26",
        "vote_average": 6.995,
        "overview": "Devara, a fearless man from a coastal region, embarks on a perilous journey into the treacherous world of the sea to safeguard the lives of his people. Unbeknownst to him, his brother Bhaira is plotting a conspiracy against him. As events unfold, Devara passes on his legacy to his mild-mannered and timid son, Varada."
    },
    "496243": {
        "title": "Parasite",
        "release_date": "2019-05-30",
        "vote_average": 8.5,
        "overview": "All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident."
    },
    "353081": {
        "title": "Mission: Impossible - Fallout",
        "release_date": "2018-07-13",
        "vote_average": 7.431,
        "overview": "When an IMF mission ends badly, the world is faced with dire consequences. As Ethan Hunt takes it upon himself to fulfill his original briefing, the CIA begin to question his loyalty and his motives. The IMF team find themselves in a race against time, hunted by assassins while trying to prevent a global catastrophe."
    },
    "912649": {
        "title": "Venom: The Last Dance",
        "release_date": "2024-10-22",
        "vote_average": 6.753,
        "overview": "Eddie and Venom are on the run. Hunted by both of their worlds and with the net closing in, the duo are forced into a devastating decision that will bring the curtains down on Venom and Eddie's last dance."
    },
    "968171": {
        "title": "Sex Education Mistresses",
        "release_date": "1973-11-20",
        "vote_average": 5.9,
        "overview": "An erotic comedy depicting the sex adventures of  young wives living in an apartment complex, that are not satisfied with just having sex with their husbands."
    },
    "384018": {
        "title": "Fast & Furious Presents: Hobbs & Shaw",
        "release_date": "2019-08-01",
        "vote_average": 6.847,
        "overview": "Ever since US Diplomatic Security Service Agent Hobbs and lawless outcast Shaw first faced off, they just have traded smack talk and body blows. But when cyber-genetically enhanced anarchist Brixton's ruthless actions threaten the future of humanity, they join forces to defeat him."
    },
    "71689": {
        "title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
        "release_date": "2011-08-05",
        "vote_average": 7.077,
        "overview": "Phineas and Ferb get trapped in an alternate dimension where the evil Doofenshmirtz rules the tri-state area. They must find a way back home with the help of their pet platypus named Perry, who they discover is a secret agent."
    },
    "1293286": {
        "title": "Gunslingers",
        "release_date": "2025-04-11",
        "vote_average": 6.48,
        "overview": "When the most wanted man in America surfaces in a small Kentucky town, his violent history -- and a blood-thirsty mob seeking vengeance and a king’s ransom -- soon follow. As brothers face off against one another and bullets tear the town to shreds, this lightning-fast gunslinger makes his enemies pay the ultimate price for their greed."
    },
    "1125880": {
        "title": "Swarm",
        "release_date": "2023-05-11",
        "vote_average": 4.5,
        "overview": "A secluded island somewhere on a seas of the Northern Europe. A family of four has lived here for over ten years, perfecting the art of survival. They had moved onto an island to escape a falling civilization, to live in freedom, close to nature.  But, things can’t be solved by simply escaping the world, and problems arise when the Mother becomes pregnant again. Moreover, Winter is coming. It seems the only solution is in leaving the island, but this meets with stern dissent from the Father, who sees the place as the only safe haven on earth. Will the others find the courage to stand up to the Father? Can their family survive what comes next?"
    },
    "333371": {
        "title": "10 Cloverfield Lane",
        "release_date": "2016-03-10",
        "vote_average": 6.992,
        "overview": "After a catastrophic car crash, a young woman wakes up in a survivalist's underground bunker, where he claims to have saved her from an apocalyptic attack that has left the outside world uninhabitable."
    },
    "2666": {
        "title": "Dark City",
        "release_date": "1998-02-27",
        "vote_average": 7.327,
        "overview": "A man struggles with memories of his past, including a wife he cannot remember, in a nightmarish world with no sun and run by beings with telekinetic powers who seek the souls of humans."
    },
    "338952": {
        "title": "Fantastic Beasts: The Crimes of Grindelwald",
        "release_date": "2018-11-14",
        "vote_average": 6.846,
        "overview": "Gellert Grindelwald has escaped imprisonment and has begun gathering followers to his cause—elevating wizards above all non-magical beings. The only one capable of putting a stop to him is the wizard he once called his closest friend, Albus Dumbledore. However, Dumbledore will need to seek help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander, who agrees to help, unaware of the dangers that lie ahead. Lines are drawn as love and loyalty are tested, even among the truest friends and family, in an increasingly divided wizarding world."
    },
    "314": {
        "title": "Catwoman",
        "release_date": "2004-07-22",
        "vote_average": 4.618,
        "overview": "Liquidated after discovering a corporate conspiracy, mild-mannered graphic artist Patience Phillips washes up on an island, where she's resurrected and endowed with the prowess of a cat — and she's eager to use her new skills... as a vigilante. Before you can say \"cat and mouse\", handsome gumshoe Tom Lone is on her tail, fascinated by both of her personas."
    },
    "460458": {
        "title": "Resident Evil: Welcome to Raccoon City",
        "release_date": "2021-11-24",
        "vote_average": 6.0,
        "overview": "Once the booming home of pharmaceutical giant Umbrella Corporation, Raccoon City is now a dying Midwestern town. The company’s exodus left the city a wasteland…with great evil brewing below the surface. When that evil is unleashed, the townspeople are forever…changed…and a small group of survivors must work together to uncover the truth behind Umbrella and make it through the night."
    },
    "371645": {
        "title": "Hunt for the Wilderpeople",
        "release_date": "2016-03-31",
        "vote_average": 7.647,
        "overview": "Ricky is a defiant young city kid who finds himself on the run with his cantankerous foster uncle in the wild New Zealand bush. A national manhunt ensues, and the two are forced to put aside their differences and work together to survive."
    },
    "4011": {
        "title": "Beetlejuice",
        "release_date": "1988-03-30",
        "vote_average": 7.375,
        "overview": "A newly dead New England couple seeks help from a deranged demon exorcist to scare an affluent New York family out of their home."
    },
    "305470": {
        "title": "Power Rangers",
        "release_date": "2017-03-23",
        "vote_average": 6.257,
        "overview": "Five ordinary teens must become something extraordinary when they learn that their small town of Angel Grove — and the world — is on the verge of being obliterated by an alien threat. Chosen by destiny, our heroes quickly discover they are the only ones who can save the planet. But to do so, they will have to overcome their real-life issues and before it’s too late, band together as the Power Rangers."
    },
    "293660": {
        "title": "Deadpool",
        "release_date": "2016-02-09",
        "vote_average": 7.622,
        "overview": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life."
    },
    "533535": {
        "title": "Deadpool & Wolverine",
        "release_date": "2024-07-24",
        "vote_average": 7.598,
        "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine."
    },
    "446696": {
        "title": "Life Itself",
        "release_date": "2018-09-21",
        "vote_average": 7.221,
        "overview": "As a young New York couple goes from college romance to marriage and the birth of their first child, the unexpected twists of their journey create reverberations that echo over continents and through lifetimes."
    },
    "405774": {
        "title": "Bird Box",
        "release_date": "2018-12-13",
        "vote_average": 6.832,
        "overview": "Five years after an ominous unseen presence drives most of society to suicide, a survivor and her two children make a desperate bid to reach safety."
    },
    "1059073": {
        "title": "Winter Spring Summer or Fall",
        "release_date": "2024-12-27",
        "vote_average": 7.337,
        "overview": "Remi and Barnes, two very different teenagers, meet by chance in the winter of their senior year, then spend four  days together over the course of a year that will change their lives forever."
    },
    "476669": {
        "title": "The King's Man",
        "release_date": "2021-12-22",
        "vote_average": 6.747,
        "overview": "As a collection of history's worst tyrants and criminal masterminds gather to plot a war to wipe out millions, one man must race against time to stop them."
    },
    "1373723": {
        "title": "The Codes of War",
        "release_date": "2025-03-20",
        "vote_average": 6.1,
        "overview": "War stories about family, ethics and honor include the true story of two U.S. Marines who in a span of six seconds, must stand their ground to stop a suicide truck bomb, a Navy Corpsman who attempts to hold on to his humanity, and a WW2 soldier who gets separated from his squad and is forced to re-evaluate his code."
    },
    "678512": {
        "title": "Sound of Freedom",
        "release_date": "2023-07-03",
        "vote_average": 7.991,
        "overview": "The story of Tim Ballard, a former US government agent, who quits his job in order to devote his life to rescuing children from global sex traffickers."
    },
    "429617": {
        "title": "Spider-Man: Far From Home",
        "release_date": "2019-06-28",
        "vote_average": 7.41,
        "overview": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent."
    },
    "567609": {
        "title": "Ready or Not",
        "release_date": "2019-08-21",
        "vote_average": 7.035,
        "overview": "A young bride's wedding night turns into her worst nightmare when her ridiculously rich in-laws force her to play a gruesome game of hide-and-seek."
    },
    "760497": {
        "title": "The Match",
        "release_date": "2025-03-26",
        "vote_average": 7.3,
        "overview": "When a legendary Go master loses his title to a one-time friend and protégé, he sets out to reclaim it in a high-stakes battle of wits and skill."
    },
    "7451": {
        "title": "xXx",
        "release_date": "2002-08-09",
        "vote_average": 5.942,
        "overview": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi."
    },
    "1049171": {
        "title": "The Temptation",
        "release_date": "2022-12-15",
        "vote_average": 4.9,
        "overview": "Toni leads a normal life with his wife Paola but full of enthusiasm and passion. The chance meeting with the young and wealthy Chiara will rekindle in him the desire to redeem himself and to realize his secret dream: to become an artist. The paths of the three will intertwine in a dangerous love triangle that will change the course of their lives forever."
    },
    "823219": {
        "title": "Flow",
        "release_date": "2024-08-29",
        "vote_average": 8.196,
        "overview": "A solitary cat, displaced by a great flood, finds refuge on a boat with various species and must navigate the challenges of adapting to a transformed world together."
    },
    "552524": {
        "title": "Lilo & Stitch",
        "release_date": "2025-05-21",
        "vote_average": 0.0,
        "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family."
    },
    "515001": {
        "title": "Jojo Rabbit",
        "release_date": "2019-10-18",
        "vote_average": 8.01,
        "overview": "A World War II satire that follows a lonely German boy whose world view is turned upside down when he discovers his single mother is hiding a young Jewish girl in their attic. Aided only by his idiotic imaginary friend, Adolf Hitler, Jojo must confront his blind nationalism."
    },
    "1076291": {
        "title": "Operation Storm",
        "release_date": "2023-01-17",
        "vote_average": 5.9,
        "overview": "Follow the story of the people who were expelled from Krajina in 1995 and the suffering of the Serb people in Croatia."
    },
    "558449": {
        "title": "Gladiator II",
        "release_date": "2024-11-13",
        "vote_average": 6.744,
        "overview": "Years after witnessing the death of the revered hero Maximus at the hands of his uncle, Lucius is forced to enter the Colosseum after his home is conquered by the tyrannical Emperors who now lead Rome with an iron fist. With rage in his heart and the future of the Empire at stake, Lucius must look to his past to find strength and honor to return the glory of Rome to its people."
    },
    "1156593": {
        "title": "Your Fault",
        "release_date": "2024-12-26",
        "vote_average": 7.145,
        "overview": "The love between Noah and Nick seems unwavering despite their parents' attempts to separate them. But his job and her entry into college open up their lives to new relationships that will shake the foundations of both their relationship and the Leister family itself."
    },
    "1229730": {
        "title": "Carjackers",
        "release_date": "2025-03-27",
        "vote_average": 6.086,
        "overview": "By day, they're invisible—valets, hostesses, and bartenders at a luxury hotel. By night, they're the Carjackers, a crew of skilled drivers who track and rob wealthy clients on the road. As they plan their ultimate heist, the hotel director hires a ruthless hitman, to stop them at all costs. With danger closing in, can Nora, Zoe, Steve, and Prestance pull off their biggest score yet?"
    },
    "919207": {
        "title": "12.12: The Day",
        "release_date": "2023-11-22",
        "vote_average": 7.5,
        "overview": "After the assassination of President Park, martial law has been declared. A coup d'état bursts out by DefenseSecurity Commander Chun Doo-gwang and a private band of officers following him. Capital Defense Commander Lee Tae-shin, an obstinate soldier who believes the military should not take political actions, fights against Chun Doo-gwang to stop him. The conflict between the two grows while military leaders are holding their decision and Defense Minister is gone. In the midst of chaos, the spring of Seoul that everyone longed for heads to unexpected direction."
    },
    "36647": {
        "title": "Blade",
        "release_date": "1998-08-21",
        "vote_average": 6.801,
        "overview": "The Daywalker known as \"Blade\" - a half-vampire, half-mortal man - becomes the protector of humanity against an underground army of vampires."
    },
    "650033": {
        "title": "Free Fall",
        "release_date": "2025-05-21",
        "vote_average": 0.0,
        "overview": "In the near future, humanity has successfully colonized space and build a giant orbital station \"Delta\". Max is a repairman working on the station. After a disaster caused by a proton storm, he is left alone without his crew members, drifting into space. His space suit is broken, he is exhausted, and he lacks communication with people. But suddenly a dispatcher named Anna comes to help. She is the only one who can guide Max through difficulties and get him to the station. Max has to risk everything to save his life, but he has no idea what Anna is up to."
    },
    "335": {
        "title": "Once Upon a Time in the West",
        "release_date": "1968-12-21",
        "vote_average": 8.281,
        "overview": "As the railroad builders advance unstoppably through the Arizona desert on their way to the sea, Jill arrives in the small town of Flagstone with the intention of starting a new life."
    },
    "977294": {
        "title": "Tin Soldier",
        "release_date": "2025-05-22",
        "vote_average": 0.0,
        "overview": "An ex-special forces operative seeks revenge against a cult leader who has corrupted his former comrades, the Shinjas. This leader, known as The Bokushi, promises veterans a purpose and protection, but is revealed to be a destructive influence. The ex-soldier, Nash Cavanaugh, joins forces with military operative Emmanuel Ashburn to infiltrate the Bokushi's fortress and expose his reign of terror"
    },
    "1064213": {
        "title": "Anora",
        "release_date": "2024-10-14",
        "vote_average": 7.043,
        "overview": "A young sex worker from Brooklyn gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as his parents set out to get the marriage annulled."
    },
    "1217690": {
        "title": "Homestead",
        "release_date": "2024-12-19",
        "vote_average": 6.0,
        "overview": "A nuclear bomb is detonated in Los Angeles, and the nation devolves into unprecedented chaos. Ex-Green Beret Jeff Eriksson and his family escape to The Homestead, an eccentric prepper’s fortress nestled in the mountains. As violent threats and apocalyptic conditions creep toward their borders, the residents of The Homestead are left to wonder: how long can a group of people resist both the dangers of human nature and the bloodshed at their doorstep?"
    },
    "927342": {
        "title": "Amaran",
        "release_date": "2024-10-31",
        "vote_average": 7.383,
        "overview": "A heroic true story of Major Mukund Varadarajan, an Indian Army officer who displayed extraordinary bravery during a counterterrorism mission in Kashmir’s Shopian district. The film captures his courage in protecting his nation and the devotion of his wife Indhu Rebecaa Varghese."
    },
    "346698": {
        "title": "Barbie",
        "release_date": "2023-07-19",
        "vote_average": 6.975,
        "overview": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans."
    },
    "569094": {
        "title": "Spider-Man: Across the Spider-Verse",
        "release_date": "2023-05-31",
        "vote_average": 8.343,
        "overview": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most."
    },
    "1356039": {
        "title": "Counterattack",
        "release_date": "2025-02-27",
        "vote_average": 8.365,
        "overview": "When a hostage rescue mission creates a new enemy, Capt. Guerrero and his elite soldiers must face an ambush by a criminal group."
    },
    "1122099": {
        "title": "The Ballad of Wallis Island",
        "release_date": "2025-03-28",
        "vote_average": 7.6,
        "overview": "Eccentric lottery winner Charles lives alone on a remote island but dreams of hiring his favourite musician, Herb McGwyer, to play an exclusive, private gig. Unbeknownst to Herb, Charles has also hired Herb’s ex-bandmate and ex-girlfriend, Nell, with her new husband in tow, to perform the old favourites. As tempers flare and old tensions resurface, the stormy weather traps them all on the island and Charles desperately looks for a way to salvage his dream gig."
    },
    "375834": {
        "title": "It's Called 'Murder', Baby",
        "release_date": "1983-06-15",
        "vote_average": 6.3,
        "overview": "In 1940s Los Angeles, private investigator Nick Popodopolis, is hired by actress Dixie Ray, to find her blackmailer.  Edited R version of adult film, Dixie Ray Hollywood Star."
    },
    "1055451": {
        "title": "Founders Day",
        "release_date": "2024-01-19",
        "vote_average": 4.541,
        "overview": "A small town is shaken by a series of ominous killings in the days leading up to a heated mayoral election."
    },
    "447273": {
        "title": "Snow White",
        "release_date": "2025-03-19",
        "vote_average": 4.5,
        "overview": "Following the benevolent King's disappearance, the Evil Queen dominated the once fair land with a cruel streak. Princess Snow White flees the castle when the Queen, in her jealousy over Snow White's inner beauty, tries to kill her. Deep into the dark woods, she stumbles upon seven magical dwarves and a young bandit named Jonathan. Together, they strive to survive the Queen's relentless pursuit and aspire to take back the kingdom."
    },
    "306": {
        "title": "Beverly Hills Cop III",
        "release_date": "1994-05-24",
        "vote_average": 5.866,
        "overview": "When his boss is killed, Detroit cop Axel Foley finds evidence that the murderer had ties to a California amusement park called Wonder World. Returning to sunny Beverly Hills once more, Foley reunites with Detective Billy Rosewood to solve the case. Along with Billy's new partner, Detective Jon Flint, they discover that Wonder World is being used as a front for a massive counterfeiting ring."
    },
    "1377424": {
        "title": "Victoria",
        "release_date": "2024-12-14",
        "vote_average": 5.0,
        "overview": "Victoria, a young beautician in a suburban beauty parlour, decides to elope with her Hindu boyfriend after a fierce clash with her conservative Catholic parents. Amidst the turmoil, a neighbour asks her to temporarily house an offering rooster destined for a festival at St. George church inside the parlour. Juggling the rooster's antics, unexpected clients, and her boyfriend's uncertainty, Victoria grapples with conflicting emotions leading to a day of intense personal and spiritual revelations."
    },
    "372058": {
        "title": "Your Name.",
        "release_date": "2016-08-26",
        "vote_average": 8.483,
        "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other."
    },
    "1317088": {
        "title": "The Assessment",
        "release_date": "2025-03-21",
        "vote_average": 7.022,
        "overview": "In a climate change-ravaged world, a utopian society optimizes life, including parenthood assessments. A successful couple faces scrutiny by an evaluator over seven days to determine their fitness for childbearing."
    },
    "24428": {
        "title": "The Avengers",
        "release_date": "2012-04-25",
        "vote_average": 7.746,
        "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!"
    },
    "693134": {
        "title": "Dune: Part Two",
        "release_date": "2024-02-27",
        "vote_average": 8.148,
        "overview": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee."
    },
    "1087891": {
        "title": "The Amateur",
        "release_date": "2025-04-09",
        "vote_average": 6.6,
        "overview": "After his life is turned upside down when his wife is killed in a London terrorist attack, a brilliant but introverted CIA decoder takes matters into his own hands when his supervisors refuse to take action."
    },
    "1038392": {
        "title": "The Conjuring: Last Rites",
        "release_date": "2025-09-04",
        "vote_average": 0.0,
        "overview": "Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront."
    },
    "361743": {
        "title": "Top Gun: Maverick",
        "release_date": "2022-05-21",
        "vote_average": 8.178,
        "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen."
    },
    "26389": {
        "title": "From Paris with Love",
        "release_date": "2010-02-04",
        "vote_average": 6.299,
        "overview": "James Reese has a good job as an ambassador's aid in France, but his real passion is a side gig—working in a minor role in the CIA. He would love to be a full-fledged agent and can't believe his luck when he lands an assignment with Charlie Wax. Trigger-happy Charlie soon has James crying for his desk job, but when he learns that the same guys they're trying to catch are after him, James realises that Charlie may be his only hope of survival."
    },
    "300668": {
        "title": "Annihilation",
        "release_date": "2018-02-22",
        "vote_average": 6.426,
        "overview": "A biologist signs up for a dangerous, secret expedition into a mysterious zone where the laws of nature don't apply."
    },
    "829557": {
        "title": "365 Days: This Day",
        "release_date": "2022-04-26",
        "vote_average": 5.9,
        "overview": "Laura and Massimo are back and hotter than ever. But the reunited couple's new beginning is complicated by Massimo’s family ties and a mysterious man who enters Laura’s life to win her heart and trust, at any cost."
    },
    "715287": {
        "title": "Stepmom's Desire",
        "release_date": "2020-05-29",
        "vote_average": 6.8,
        "overview": "Sang-jin, who was envious of her neighbor after getting a beautiful wife, Ask your wife's friend Gian to take over the son's extracurricular teacher, Sang-jin, who left work early, accidentally sees Gian's shower. A man who wants to have sex with his son's tutor, And a son who wants to have a good time with a young stepmom, Ji-an and Jin-hee, who want money, are disappointed with her husband, and Bin-jin gives her body to a young son."
    },
    "1010818": {
        "title": "Groot's First Steps",
        "release_date": "2022-08-10",
        "vote_average": 6.981,
        "overview": "Following the events of “Guardians of the Galaxy Vol. 1,” Baby Groot is finally ready to try taking his first steps out of his pot—only to learn you have to walk before you can run."
    },
    "1405338": {
        "title": "Demon City",
        "release_date": "2025-02-26",
        "vote_average": 6.928,
        "overview": "Framed for his family's murder and left for dead, an ex-hitman will stop at nothing to exact revenge on the masked \"demons\" who have taken over his city."
    },
    "1055871": {
        "title": "Death Is a Problem for the Living",
        "release_date": "2023-09-22",
        "vote_average": 6.5,
        "overview": "The cheapest drivers in the hearse business, gambling addict Risto Kivi and his friend Arto Niska, an 85% brainless man, have found themselves in a situation where everything has gone wrong and a fresh start is needed."
    },
    "1294203": {
        "title": "My Fault: London",
        "release_date": "2025-02-12",
        "vote_average": 7.478,
        "overview": "18-year-old Noah moves from America to London, with her mother who's recently fallen in love with William, a wealthy British businessman. Noah meets William’s son, bad-boy Nick, and soon discovers there is an attraction between them neither can avoid. As Noah spends the summer adjusting to her new life, her devastating past will catch up with her while falling in love for the first time."
    },
    "385687": {
        "title": "Fast X",
        "release_date": "2023-05-17",
        "vote_average": 7.0,
        "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever."
    },
    "157336": {
        "title": "Interstellar",
        "release_date": "2014-11-05",
        "vote_average": 8.455,
        "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage."
    },
    "326425": {
        "title": "Extraction",
        "release_date": "2015-12-18",
        "vote_average": 4.6,
        "overview": "When a former CIA operative is kidnapped by a group of terrorists, his son learns there is no plan for his father to be saved—so he launches his own rescue operation."
    },
    "424694": {
        "title": "Bohemian Rhapsody",
        "release_date": "2018-10-24",
        "vote_average": 7.976,
        "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess."
    },
    "597": {
        "title": "Titanic",
        "release_date": "1997-11-18",
        "vote_average": 7.905,
        "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912."
    },
    "419430": {
        "title": "Get Out",
        "release_date": "2017-02-24",
        "vote_average": 7.619,
        "overview": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined."
    },
    "592695": {
        "title": "Pleasure",
        "release_date": "2021-10-08",
        "vote_average": 6.295,
        "overview": "19 year old Linnéa leaves her small town in Sweden and heads for Los Angeles with the aim of becoming the world's next big porn star, but the road to her goal turns out to be bumpier than she imagined."
    },
    "1160956": {
        "title": "Panda Plan",
        "release_date": "2024-10-01",
        "vote_average": 6.863,
        "overview": "International action star Jackie Chan is invited to the adoption ceremony of a rare baby panda, but after an international crime syndicate attempts to kidnap the bear, Jackie has to save the bear using his stunt work skills."
    },
    "1353117": {
        "title": "Home Sweet Home: Rebirth",
        "release_date": "2025-03-20",
        "vote_average": 6.4,
        "overview": "When a city is overrun with a demonically-possessed crowd, a cop must find the source of evil to save his family."
    },
    "1084199": {
        "title": "Companion",
        "release_date": "2025-01-22",
        "vote_average": 7.077,
        "overview": "During a weekend getaway at a secluded lakeside estate, a group of friends finds themselves entangled in a web of secrets, deception, and advanced technology. As tensions rise and loyalties are tested, they uncover unsettling truths about themselves and the world around them."
    },
    "399170": {
        "title": "Logan Lucky",
        "release_date": "2017-08-17",
        "vote_average": 6.728,
        "overview": "Trying to reverse a family curse, brothers Jimmy and Clyde Logan set out to execute an elaborate robbery during the legendary Coca-Cola 600 race at the Charlotte Motor Speedway."
    },
    "440471": {
        "title": "Escape Plan 2: Hades",
        "release_date": "2018-06-05",
        "vote_average": 5.153,
        "overview": "Ray Breslin manages an elite team of security specialists trained in the art of breaking people out of the world's most impenetrable prisons. When his most trusted operative, Shu Ren, is kidnapped and disappears inside the most elaborate prison ever built, Ray must track him down with the help of some of his former friends."
    },
    "845781": {
        "title": "Red One",
        "release_date": "2024-10-31",
        "vote_average": 7.047,
        "overview": "After Santa Claus (codename: Red One) is kidnapped, the North Pole's Head of Security must team up with the world's most infamous tracker in a globe-trotting, action-packed mission to save Christmas."
    },
    "299536": {
        "title": "Avengers: Infinity War",
        "release_date": "2018-04-25",
        "vote_average": 8.236,
        "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain."
    },
    "259872": {
        "title": "Skin. Like. Sun.",
        "release_date": "2009-10-10",
        "vote_average": 5.784,
        "overview": "Real-life young couple Wim and Floor spend an afternoon in the sunwashed rooms of a crumbling home in Belgium. In a unique twist, this artistic erotic documentary is edited in nearly real-time. In the slowness, we get the build, the sweetness, and the sexiness. Forget about fingersnapping fast editing. Slow is where it’s at."
    },
    "1101401": {
        "title": "Sugar Baby",
        "release_date": "2024-10-15",
        "vote_average": 6.038,
        "overview": "An enterprising Sugar Baby is offered $30,000 to move in with her Sugar Daddy for the week, but soon discovers the sinister secrets trapped within his home."
    },
    "473": {
        "title": "Pi",
        "release_date": "1998-07-10",
        "vote_average": 7.112,
        "overview": "A mathematical genius discovers a link between numbers and reality, and thus believes he can predict the future."
    },
    "1297763": {
        "title": "Batman Ninja vs. Yakuza League",
        "release_date": "2025-03-17",
        "vote_average": 6.6,
        "overview": "The Batman family has returned to the present to discover that Japan has disappeared, and a giant island - Hinomoto - is now in the sky over Gotham City.  At the top sit the Yakuza, a group of superpowered individuals who reign without honor or humanity and look suspiciously like the Justice League. Now, it’s up to Batman and his allies to save Gotham!"
    },
    "945961": {
        "title": "Alien: Romulus",
        "release_date": "2024-08-13",
        "vote_average": 7.204,
        "overview": "While scavenging the deep ends of a derelict space station, a group of young space colonizers come face to face with the most terrifying life form in the universe."
    },
    "1284120": {
        "title": "The Ugly Stepsister",
        "release_date": "2025-03-07",
        "vote_average": 7.615,
        "overview": "In a fairy-tale kingdom where beauty is a brutal business, Elvira battles to compete with her incredibly beautiful stepsister, and she will go to any length to catch the prince’s eye."
    },
    "1011985": {
        "title": "Kung Fu Panda 4",
        "release_date": "2024-03-02",
        "vote_average": 7.069,
        "overview": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past."
    },
    "1195430": {
        "title": "Deva",
        "release_date": "2025-01-31",
        "vote_average": 6.0,
        "overview": "Dev Ambre, a ruthless cop, loses his memory in an accident just after he has finished solving a murder case and now has to reinvestigate it while keeping his memory loss a secret from everyone except DCP Farhan Khan."
    }
}